export const uk = {
  test: 'Українська',
  button: {
    counts: 'Кліків на даний момент: {{count}}',
  },
  signup: 'Реєстрація',
  signin: 'Вхід',
  // welcome page
  textLeft: {
    title: 'Трекер споживання води',
    text1: 'Записуйте щоденний прийом води та ведіть відстеження',
    text2: 'Переваги трекера',
    text3: 'Рушій звички',
    text4: 'Перегляд статистики',
    text5: 'Персональне налаштування режиму',
  },
  textRight: {
    listTitle: 'Навіщо пити воду?',
    listItem1: 'Постачання поживних речовин усім органам',
    listItem2: 'Забезпечення киснем легенів',
    listItem3: 'Підтримка роботи серця',
    listItem4: 'Прискорення обміну речовин',
    listItem5: 'Забезпечення стабільності внутрішнього середовища організму',
    listItem6: 'Підтримка нормальної температури тіла',
    listItem7: 'Підтримка імунної системи при боротьбі з хворобами',
  },

  forms: {
    email: 'Введіть свою електронну адресу',
    password: 'Введіть свій пароль',
    repeatPassword: 'Повторіть пароль',
  },
  errors: {
    email: "Електронна пошта обов'язкова",
    invalidEmail: 'Недійсна адреса електронної пошти',
    domain: 'Недійсний домен електронної пошти',
    password: "Пароль обов'язковий",
    minPassword: 'Пароль повинен містити щонайменше 8 символів',
    maxPass: 'Пароль повинен містити щонайбільше 64 символів',
    repeatPassword: 'Паролі повинні співпадати',
  },

  buttons: {
    welcomepage: 'Спробувати трекер',
    signup: 'Зареєструватися',
    signin: 'Увійти',
    logout: 'Вийти',
    settings: 'Налаштування',
  },
};

// {t(button.counts), {click: count}}
