export const uk = {
  // Homepage dailyNorma
  myDailyNorma: 'Моя денна норма',
  edit: 'Редагувати',
  l: 'Л',
  ml: 'мл',

  // dailyNorma Modal
  female: 'Жінка',
  male: 'Чоловік',
  formulaDescription:
    "V - це об'єм води норми в літрах на день, M  ваша маса тіла, T - час активного спорту або іншого типу діяльності, що еквівалентна за навантаженням (у відсутності таких, слід встановити 0).",
  calculateRate: 'Розрахуйте свою норму:',
  weight: 'Ваша маса в кілограмах:',
  timeForSports:
    'Час активного участі в спорті або інших діяльностях з великим фізичним навантаженням в годинах:',
  resultLiters: 'Необхідна кількість води в літрах на день:',
  userAmountWater: 'Запишіть, скільки води ви будете пити:',
  save: 'Зберегти',

  //deleteWater:
  deleteEntry: 'Видалити запис',
  sureDeleteEntry: 'Ви впевнені, що хочете видалити цей запис?',
  delete: 'Видалити',
  cancel: 'Скасувати',

  //statsTableCalendar:
  month: 'Місяць',
  noInformation: 'Немає інформації',
  dailyNorma: 'Денна норма:',
  fulfillment: 'Виконання денної норми:',
  servingsOfWater: 'Скільки порцій води:',

  //AddOrEditWaterModals
  addWater: 'Додати воду',
  editWater: 'Відредагуйте введену кількість води',
  noNotesYet: 'Ще немає записів',
  correctData: 'Виправте введені дані:',
  chooseValue: 'Виберіть значення:',
  amountWater: 'Кількість води:',
  recordingTime: 'Час запису:',
  waterUsed: 'Введіть значення використаної води:',

  // Homepage WaterTodayList
  today: 'Сьогодні',
  haveNotDrunkYet: {
    p1: 'Ой лишенько',
    p2: 'Ти ще не випив води. Не забувай дотримуватися своєї щоденної норми!',
    p3: 'Це трішки сумно',
    p4: 'АЛЕЕЕ, якщо ви вже попили, то швиденько додавайте, аби не забути',
  },
  //SettingUser
  logOut: 'Вийти',
  //SettingModal
  setting: 'Налаштування',
  yourPhoto: 'Ваше фото',
  uploadPhoto: 'Завантажте фото',
  //SettingForm
  yourGender: 'Ваша гендерна ідентичність',
  yourName: "Ваше ім'я",
  email: 'Електронна пошта',
  password: 'Пароль',
  outdatedPassword: 'Застарілий пароль:',
  newPassword: 'Новий пароль:',
  repeatNewPassword: 'Повторіть новий пароль:',

  //LogoutModal
  wantToLeave: 'Ви впевнені, що хочете вийти?',
  signup: 'Реєстрація',
  signin: 'Вхід',

  // welcome page
  textLeft: {
    title: 'Трекер споживання води',
    text1: 'Записуйте щоденний прийом води та ведіть відстеження',
    text2: 'Переваги трекера',
    text3: 'Рушій звички',
    text4: 'Перегляд статистики',
    text5: 'Персональне налаштування режиму',
  },
  textRight: {
    listTitle: 'Навіщо пити воду?',
    listItem1: 'Постачання поживних речовин усім органам',
    listItem2: 'Забезпечення киснем легенів',
    listItem3: 'Підтримка роботи серця',
    listItem4: 'Прискорення обміну речовин',
    listItem5: 'Забезпечення стабільності внутрішнього середовища організму',
    listItem6: 'Підтримка нормальної температури тіла',
    listItem7: 'Підтримка імунної системи при боротьбі з хворобами',
  },

  forms: {
    email: 'Введіть свою електронну адресу',
    password: 'Введіть свій пароль',
    repeatPassword: 'Повторіть пароль',
  },
  errors: {
    email: "Електронна пошта обов'язкова",
    invalidEmail: 'Недійсна адреса електронної пошти',
    domain: 'Недійсний домен електронної пошти',
    password: "Пароль обов'язковий",
    minPassword: 'Пароль повинен містити щонайменше 8 символів',
    maxPass: 'Пароль повинен містити щонайбільше 64 символів',
    repeatPassword: 'Паролі повинні співпадати',
  },

  buttons: {
    welcomepage: 'Спробувати трекер',
    signup: 'Зареєструватися',
    signin: 'Увійти',
    logout: 'Вийти',
    settings: 'Налаштування',
  },

  deleteAccount: 'Видалити акаунт',
  sureDeleteAccount: 'Ви точно, що хочете видалити свій обліковий запис?:(',
};
